windowsair/elaphure-dap.js/device/deviceList/NXP/LPC54114/NXP.LPC54114_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_cs42888_adapter" Cversion="2.2.1" condition="device.LPC54114_AND_driver.codec_AND_driver.cs42888">
      <description>Component cs42888 adapter for multi codecs; {for-development:SDK-Manifest-ID: component.codec_cs42888_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/fsl_cs42888_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_cs42888_adapter.h"/>
        <file category="sourceC" name="components/codec/port/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_da7212_adapter" Cversion="2.2.0" condition="device.LPC54114_AND_driver.codec_AND_driver.dialog7212">
      <description>Component da7212 adapter for multi codecs; {for-development:SDK-Manifest-ID: component.codec_da7212_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/fsl_da7212_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_da7212_adapter.h"/>
        <file category="sourceC" name="components/codec/port/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c" Cversion="2.1.0" condition="device.LPC54114_AND_component.flexcomm_i2c_adapter_AND_driver.common">
      <description>Component codec_i2c; {for-development:SDK-Manifest-ID: component.codec_i2c.LPC54114}</description>
      <files>
        <file category="header" name="components/codec/i2c/fsl_codec_i2c.h"/>
        <file category="sourceC" name="components/codec/i2c/fsl_codec_i2c.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_sgtl_adapter" Cversion="2.2.0" condition="device.LPC54114_AND_driver.codec_AND_driver.sgtl5000">
      <description>Component sgtl5000 adapter for multi codecs; {for-development:SDK-Manifest-ID: component.codec_sgtl_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/fsl_sgtl_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_sgtl_adapter.h"/>
        <file category="sourceC" name="components/codec/port/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_wm8904_adapter" Cversion="2.2.0" condition="device.LPC54114_AND_driver.codec_AND_driver.wm8904">
      <description>Component wm8904 adapter for multi codecs; {for-development:SDK-Manifest-ID: component.codec_wm8904_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/fsl_wm8904_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_wm8904_adapter.h"/>
        <file category="sourceC" name="components/codec/port/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_wm8960_adapter" Cversion="2.2.0" condition="device.LPC54114_AND_driver.codec_AND_driver.wm8960">
      <description>Component wm8960 adapter for multi codecs; {for-development:SDK-Manifest-ID: component.codec_wm8960_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/fsl_wm8960_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_wm8960_adapter.h"/>
        <file category="sourceC" name="components/codec/port/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common_task" Cversion="1.0.0" condition="device.LPC54114_AND_component.osa_AND_driver.common">
      <description>Component common_task; {for-development:SDK-Manifest-ID: component.common_task.LPC54114}</description>
      <files>
        <file category="header" name="components/common_task/fsl_component_common_task.h"/>
        <file category="sourceC" name="components/common_task/fsl_component_common_task.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter" Cversion="2.2.1" condition="device.LPC54114_AND_driver.codec_AND_driver.cs42888">
      <description>Component cs42888 adapter for single codec; {for-development:SDK-Manifest-ID: component.cs42888_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/cs42888/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/cs42888/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common_AND_driver.ctimer">
      <description>Component ctimer_adapter; {for-development:SDK-Manifest-ID: component.ctimer_adapter.LPC54114}</description>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h"/>
        <file category="sourceC" name="components/timer/fsl_adapter_ctimer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter" Cversion="2.2.0" condition="device.LPC54114_AND_driver.codec_AND_driver.dialog7212">
      <description>Component da7212 adapter for single codec; {for-development:SDK-Manifest-ID: component.da7212_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/da7212/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/da7212/fsl_codec_adapter.h"/>
      </files>
    </component>
