windowsair/elaphure-dap.js/device/deviceList/NXP/LPC54114/NXP.LPC54114_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="osa_bm" Cversion="1.0.0" condition="device.LPC54114_AND_component.lists_AND_driver.common">
      <description>Component osa_bm; {for-development:SDK-Manifest-ID: component.osa_bm.LPC54114}</description>
      <files>
        <file category="header" name="components/osa/fsl_os_abstraction.h"/>
        <file category="header" name="components/osa/fsl_os_abstraction_bm.h"/>
        <file category="header" name="components/osa/fsl_os_abstraction_config.h"/>
        <file category="sourceC" name="components/osa/fsl_os_abstraction_bm.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common_AND_utility.debug_console">
      <description>Component panic; {for-development:SDK-Manifest-ID: component.panic.LPC54114}</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm_ctimer_adapter" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common_AND_driver.ctimer">
      <description>Component pwm_ctimer_adapter; {for-development:SDK-Manifest-ID: component.pwm_ctimer_adapter.LPC54114}</description>
      <files>
        <file category="header" name="components/pwm/fsl_adapter_pwm.h"/>
        <file category="sourceC" name="components/pwm/fsl_adapter_pwm_ctimer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.LPC54114_AND__component.serial_manager_swo_OR_component.serial_manager_uart_OR_component.serial_manager_virtual__AND_component.lists_AND_driver.common">
      <description>Component serial_manager; {for-development:SDK-Manifest-ID: component.serial_manager.LPC54114}</description>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_manager.h"/>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_internal.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_manager.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo" Cversion="1.0.0" condition="device.LPC54114_AND_component.serial_manager_AND_core_type.cm4f_AND_driver.common">
      <description>Component serial_manager_swo; {for-development:SDK-Manifest-ID: component.serial_manager_swo.LPC54114}</description>
      <RTE_Components_h>
#define SERIAL_PORT_TYPE_SWO 1
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_swo.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_swo.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.LPC54114_AND_component.serial_manager_AND_component.usart_adapter_AND_driver.flexcomm_usart">
      <description>Component serial_manager_uart; {for-development:SDK-Manifest-ID: component.serial_manager_uart.LPC54114}</description>
      <RTE_Components_h>
#define SERIAL_PORT_TYPE_UART 1
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_uart.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_uart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual" Cversion="1.0.0" condition="device.LPC54114_AND_component.serial_manager_AND_driver.common">
      <description>Component serial_manager_virtual; {for-development:SDK-Manifest-ID: component.serial_manager_virtual.LPC54114}</description>
      <RTE_Components_h>
#define SERIAL_PORT_TYPE_VIRTUAL 1
#define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_virtual.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_virtual.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter" Cversion="2.2.0" condition="device.LPC54114_AND_driver.codec_AND_driver.sgtl5000">
      <description>Component sgtl5000 adapter for single codec; {for-development:SDK-Manifest-ID: component.sgtl_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/sgtl5000/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/sgtl5000/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_crc_adapter" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common">
      <description>Component software_crc_adapter; {for-development:SDK-Manifest-ID: component.software_crc_adapter.LPC54114}</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h"/>
        <file category="sourceC" name="components/crc/fsl_adapter_software_crc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common">
      <description>Component software_rng_adapter; {for-development:SDK-Manifest-ID: component.software_rng_adapter.LPC54114}</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h"/>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="device.LPC54114_AND__component.ctimer_adapter_OR_component.mrt_adapter__AND_component.lists_AND_driver.common">
      <description>Component timer_manager; {for-development:SDK-Manifest-ID: component.timer_manager.LPC54114}</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_usart">
      <description>Component usart_adapter; {for-development:SDK-Manifest-ID: component.usart_adapter.LPC54114}</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h"/>
        <file category="sourceC" name="components/uart/fsl_adapter_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="device.LPC54114_AND_driver.codec_AND_driver.wm8904">
      <description>Component wm8904 adapter for single codec; {for-development:SDK-Manifest-ID: component.wm8904_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="device.LPC54114_AND_driver.codec_AND_driver.wm8960">
      <description>Component wm8960 adapter for single codecs; {for-development:SDK-Manifest-ID: component.wm8960_adapter.LPC54114}</description>
      <files>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_adapter.c"/>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC54114_header" Cversion="1.0.0" condition="device.LPC54114_AND_CMSIS_Include_core_cm0plus_OR_CMSIS_Include_core_cm4">
      <description>Device LPC54114_cmsis; {for-development:SDK-Manifest-ID: platform.devices.LPC54114_CMSIS.LPC54114}</description>
      <files>
        <file category="header" name="fsl_device_registers.h"/>
        <file condition="core_type.cm0p" category="header" name="LPC54114_cm0plus.h"/>
        <file condition="core_type.cm0p" category="header" name="LPC54114_cm0plus_features.h"/>
        <file condition="core_type.cm4f" category="header" name="LPC54114_cm4.h"/>
        <file condition="core_type.cm4f" category="header" name="LPC54114_cm4_features.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="device.LPC54114_AND__armclang_OR_iar__AND_device.LPC54114_system">
      <description>Device LPC54114_startup; {for-development:SDK-Manifest-ID: platform.devices.LPC54114_startup.LPC54114}</description>
      <files>
        <file condition="core_type.cm0p_AND_mdk" category="sourceAsm" name="arm/startup_LPC54114_cm0plus.S"/>
        <file condition="core_type.cm4f_AND_mdk" category="sourceAsm" name="arm/startup_LPC54114_cm4.S"/>
        <file condition="core_type.cm0p_AND_iar" category="sourceAsm" name="iar/startup_LPC54114_cm0plus.s"/>
        <file condition="core_type.cm4f_AND_iar" category="sourceAsm" name="iar/startup_LPC54114_cm4.s"/>
        <file condition="core_type.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54114J256_cm0plus.scf" version="1.1.0"/>
        <file condition="core_type.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54114J256_cm0plus_ram.scf" version="1.1.0"/>
        <file condition="core_type.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54114J256_cm4.scf" version="1.1.0"/>
        <file condition="core_type.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54114J256_cm4_ram.scf" version="1.1.0"/>
        <file condition="core_type.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54114J256_cm0plus.icf" version="1.1.0"/>
        <file condition="core_type.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54114J256_cm0plus_ram.icf" version="1.1.0"/>
        <file condition="core_type.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54114J256_cm4.icf" version="1.1.0"/>
        <file condition="core_type.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54114J256_cm4_ram.icf" version="1.1.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC54114_system" Cversion="1.0.0" condition="device.LPC54114_AND_device.LPC54114_CMSIS">
      <description>Device LPC54114_system; {for-development:SDK-Manifest-ID: platform.devices.LPC54114_system.LPC54114}</description>
      <files>
        <file condition="core_type.cm0p" category="sourceC" name="system_LPC54114_cm0plus.c"/>
        <file condition="core_type.cm0p" category="header" name="system_LPC54114_cm0plus.h"/>
        <file condition="core_type.cm4f" category="sourceC" name="system_LPC54114_cm4.c"/>
        <file condition="core_type.cm4f" category="header" name="system_LPC54114_cm4.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.2.0" condition="device.LPC54114_AND_driver.common_AND_driver.power">
      <description>Clock Driver; {for-development:SDK-Manifest-ID: platform.drivers.clock.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="flexcomm_i2c_cmsis" Cversion="2.2.0" condition="device.LPC54114_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.flexcomm_i2c_dma">
      <description>I2C CMSIS Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_i2c_cmsis.LPC54114}</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_i2c_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_i2c_cmsis.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="flexcomm_spi_cmsis" Cversion="2.4.0" condition="device.LPC54114_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.flexcomm_spi_dma">
      <description>SPI CMSIS Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_spi_cmsis.LPC54114}</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_spi_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_spi_cmsis.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="flexcomm_usart_cmsis" Cversion="2.2.0" condition="device.LPC54114_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.flexcomm_usart_dma">
      <description>USART CMSIS Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_usart_cmsis.LPC54114}</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_usart_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_usart_cmsis.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.2.1" condition="device.LPC54114_AND__component.codec_cs42888_adapter_OR_component.codec_da7212_adapter_OR_component.codec_sgtl_adapter_OR_component.codec_wm8904_adapter_OR_component.codec_wm8960_adapter_OR_component.cs42888_adapter_OR_component.da7212_adapter_OR_component.sgtl_adapter_OR_component.wm8904_adapter_OR_component.wm8960_adapter__AND_driver.common">
      <description>Driver codec; {for-development:SDK-Manifest-ID: driver.codec.LPC54114}</description>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.2.9" condition="device.LPC54114_AND_device.LPC54114_CMSIS_AND_driver.clock_AND_driver.reset">
      <description>COMMON Driver; {for-development:SDK-Manifest-ID: platform.drivers.common.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888" Cversion="2.1.2" condition="device.LPC54114_AND_component.codec_i2c_AND_driver.common">
      <description>Driver cs42888; {for-development:SDK-Manifest-ID: driver.cs42888.LPC54114}</description>
      <files>
        <file category="header" name="components/codec/cs42888/fsl_cs42888.h"/>
        <file category="sourceC" name="components/codec/cs42888/fsl_cs42888.c"/>
      </files>
    </component>
