windowsair/elaphure-dap.js/device/deviceList/NXP/LPC54114/NXP.LPC54114_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer" Cversion="2.2.1" condition="device.LPC54114_AND_driver.common">
      <description>CTimer Driver; {for-development:SDK-Manifest-ID: platform.drivers.ctimer.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_ctimer.h"/>
        <file category="sourceC" name="drivers/fsl_ctimer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.2.2" condition="device.LPC54114_AND_component.codec_i2c_AND_driver.common">
      <description>Driver dialog7212; {for-development:SDK-Manifest-ID: driver.dialog7212.LPC54114}</description>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic" Cversion="2.3.0" condition="device.LPC54114_AND_driver.common">
      <description>DMIC Driver; {for-development:SDK-Manifest-ID: platform.drivers.dmic.LPC54114}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dmic.c"/>
        <file category="header" name="drivers/fsl_dmic.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic_dma" Cversion="2.3.0" condition="device.LPC54114_AND_driver.dmic_AND_driver.lpc_dma">
      <description>DMIC DMA Driver; {for-development:SDK-Manifest-ID: platform.drivers.dmic_dma.LPC54114}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dmic_dma.c"/>
        <file category="header" name="drivers/fsl_dmic_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic_hwvad" Cversion="2.3.0" condition="device.LPC54114_AND_driver.common_AND_driver.dmic">
      <description>DMIC HWVAD Driver; {for-development:SDK-Manifest-ID: platform.drivers.dmic_hwvad.LPC54114}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dmic.c"/>
        <file category="header" name="drivers/fsl_dmic.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flashiap" Cversion="2.0.5" condition="device.LPC54114_AND_driver.common">
      <description>FLASHIAP Driver; {for-development:SDK-Manifest-ID: platform.drivers.flashiap.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_flashiap.h"/>
        <file category="sourceC" name="drivers/fsl_flashiap.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm" Cversion="2.0.2" condition="device.LPC54114_AND_driver.common">
      <description>FLEXCOMM Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_flexcomm.h"/>
        <file category="sourceC" name="drivers/fsl_flexcomm.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.1.0" condition="device.LPC54114_AND_driver.common_AND_driver.flexcomm">
      <description>I2C Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_i2c.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_i2c.h"/>
        <file category="sourceC" name="drivers/fsl_i2c.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma" Cversion="2.1.0" condition="device.LPC54114_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_i2c_AND_driver.lpc_dma">
      <description>I2C Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_i2c_dma.LPC54114}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_i2c_dma.c"/>
        <file category="header" name="drivers/fsl_i2c_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s" Cversion="2.2.2" condition="device.LPC54114_AND_driver.common_AND_driver.flexcomm">
      <description>I2S Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_i2s.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_i2s.h"/>
        <file category="sourceC" name="drivers/fsl_i2s.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s_dma" Cversion="2.2.2" condition="device.LPC54114_AND_driver.flexcomm_i2s_AND_driver.lpc_dma">
      <description>I2S Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_i2s_dma.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_i2s_dma.h"/>
        <file category="sourceC" name="drivers/fsl_i2s_dma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.2.1" condition="device.LPC54114_AND_driver.common_AND_driver.flexcomm">
      <description>SPI Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_spi.LPC54114}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_spi.c"/>
        <file category="header" name="drivers/fsl_spi.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.1.1" condition="device.LPC54114_AND_driver.flexcomm_AND_driver.flexcomm_spi_AND_driver.lpc_dma">
      <description>SPI Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_spi_dma.LPC54114}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_spi_dma.c"/>
        <file category="header" name="drivers/fsl_spi_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.4.0" condition="device.LPC54114_AND_driver.flexcomm">
      <description>USART Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_usart.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_usart.h"/>
        <file category="sourceC" name="drivers/fsl_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.3.1" condition="device.LPC54114_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_dma">
      <description>USART Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexcomm_usart_dma.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_usart_dma.h"/>
        <file category="sourceC" name="drivers/fsl_usart_dma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fmeas" Cversion="2.1.1" condition="device.LPC54114_AND_driver.common">
      <description>FMEAS Driver; {for-development:SDK-Manifest-ID: platform.drivers.fmeas.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_fmeas.h"/>
        <file category="sourceC" name="drivers/fsl_fmeas.c"/>
      </files>
    </component>
