windowsair/elaphure-dap.js/device/deviceList/NXP/LPC54114/NXP.LPC54114_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fro_calib" Cversion="2.0.1" condition="device.LPC54114_AND_driver.common">
      <description>FRO calibration driver with calibration Lib; {for-development:SDK-Manifest-ID: platform.drivers.fro_calib.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_fro_calib.h"/>
        <file condition="core_type.cm4f_AND_mdk" category="library" name="arm/keil_lib_fro_calib.lib"/>
        <file condition="core_type.cm0p_AND_mdk" category="library" name="arm/keil_lib_fro_calib_m0.lib"/>
        <file condition="core_type.cm4f_AND_iar" category="library" name="iar/iar_lib_fro_calib.a"/>
        <file condition="core_type.cm0p_AND_iar" category="library" name="iar/iar_lib_fro_calib_m0.a"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft6x06" Cversion="1.0.0" condition="device.LPC54114_AND_CMSIS_Driver_Include.I2C">
      <description>Driver ft6x06; {for-development:SDK-Manifest-ID: driver.ft6x06.LPC54114}</description>
      <files>
        <file category="header" name="components/ft6x06/fsl_ft6x06.h"/>
        <file category="sourceC" name="components/ft6x06/fsl_ft6x06.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gint" Cversion="2.0.3" condition="device.LPC54114_AND_driver.common">
      <description>GINT Driver; {for-development:SDK-Manifest-ID: platform.drivers.gint.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_gint.h"/>
        <file category="sourceC" name="drivers/fsl_gint.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iap" Cversion="2.0.4" condition="device.LPC54114_AND_driver.common">
      <description>IAP Driver; {for-development:SDK-Manifest-ID: platform.drivers.iap.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_iap.h"/>
        <file category="sourceC" name="drivers/fsl_iap.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.1" condition="device.LPC54114_AND_driver.common">
      <description>Driver ili9341; {for-development:SDK-Manifest-ID: driver.ili9341.LPC54114}</description>
      <files>
        <file category="header" name="components/ili9341/fsl_ili9341.h"/>
        <file category="sourceC" name="components/ili9341/fsl_ili9341.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.3" condition="device.LPC54114_AND_driver.common_AND_driver.inputmux_connections">
      <description>INPUTMUX Driver; {for-development:SDK-Manifest-ID: platform.drivers.inputmux.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_inputmux.h"/>
        <file category="sourceC" name="drivers/fsl_inputmux.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.1" condition="device.LPC54114_AND_driver.common">
      <description>Inputmux_connections Driver; {for-development:SDK-Manifest-ID: platform.drivers.inputmux_connections.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_inputmux_connections.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.5.0" condition="device.LPC54114_AND_driver.common">
      <description>ADC Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpc_adc.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_adc.h"/>
        <file category="sourceC" name="drivers/fsl_adc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc" Cversion="2.1.1" condition="device.LPC54114_AND_driver.common">
      <description>CRC Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpc_crc.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_crc.h"/>
        <file category="sourceC" name="drivers/fsl_crc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.4.2" condition="device.LPC54114_AND_driver.common">
      <description>DMA Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpc_dma.LPC54114}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dma.c"/>
        <file category="header" name="drivers/fsl_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.7" condition="device.LPC54114_AND_driver.common">
      <description>GPIO Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpc_gpio.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_gpio.h"/>
        <file category="sourceC" name="drivers/fsl_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iocon" Cversion="2.1.2" condition="device.LPC54114_AND_driver.common">
      <description>IOCON Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpc_iocon.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_iocon.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_rtc" Cversion="2.1.2" condition="device.LPC54114_AND_driver.common">
      <description>RTC Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpc_rtc.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_rtc.h"/>
        <file category="sourceC" name="drivers/fsl_rtc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mailbox" Cversion="2.0.0" condition="device.LPC54114_AND_driver.common">
      <description>MAILBOX Driver; {for-development:SDK-Manifest-ID: platform.drivers.mailbox.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_mailbox.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt" Cversion="2.0.3" condition="device.LPC54114_AND_driver.common">
      <description>MRT Driver; {for-development:SDK-Manifest-ID: platform.drivers.mrt.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_mrt.h"/>
        <file category="sourceC" name="drivers/fsl_mrt.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="1.0.0" condition="device.LPC54114">
      <description>Driver mx25r_flash; {for-development:SDK-Manifest-ID: driver.mx25r_flash.LPC54114}</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pint" Cversion="2.1.8" condition="device.LPC54114_AND_driver.common">
      <description>PINT Driver; {for-development:SDK-Manifest-ID: platform.drivers.pint.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_pint.h"/>
        <file category="sourceC" name="drivers/fsl_pint.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="2.0.0" condition="device.LPC54114_AND_driver.common">
      <description>Power driver with Power Lib Hard ABI; {for-development:SDK-Manifest-ID: platform.drivers.power.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_power.h"/>
        <file category="sourceC" name="drivers/fsl_power.c"/>
        <file condition="core_type.cm4f_AND_mdk" category="library" name="arm/keil_lib_power.lib"/>
        <file condition="core_type.cm0p_AND_mdk" category="library" name="arm/keil_lib_power_m0.lib"/>
        <file condition="core_type.cm4f_AND_iar" category="library" name="iar/iar_lib_power.a"/>
        <file condition="core_type.cm0p_AND_iar" category="library" name="iar/iar_lib_power_m0.a"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.0.1" condition="device.LPC54114_AND_driver.common">
      <description>Reset Driver; {for-development:SDK-Manifest-ID: platform.drivers.reset.LPC54114}</description>
      <files>
        <file category="header" name="drivers/fsl_reset.h"/>
        <file category="sourceC" name="drivers/fsl_reset.c"/>
      </files>
    </component>
